// // 10. Напишите программу, вычисляющую объём куба и площадь его полной
// // поверхности, по введённому значению длины ребра. Используйте формулы:
// // V = a2, S = 6∙a2


// 10. Напишите программу, вычисляющую объём куба и площадь его полной
// поверхности, по введённому значению длины ребра. Используйте формулы:
// V = a2, S = 6∙a 2

let a = prompt('Введите значение значение длины ребра!');

let V = a ** 2;
let S = 6 * (a**2);

console.log('Объем куба: ' + V, 'площадь его полной поверхности: ' + S);





