// 1. На входе пустой объект. Выполните задание из каждого пункта:
// • Добавьте свойство id со значением 1
// • Добавьте свойство name со значением udemy
// • Измените значение свойства name на hschool
// • Удалите свойство name из объекта

// 2. На входе статичный объект. Необходимо вывести все числовые ключи.


// 3. На входе статичный объект. Необходимо вывести все числовые значения.


// 4. На входе статичный объект. Необходимо вывести все четные значения объекта.


// 5. На входе статичный объект. Необходимо сформировать массив из всех нечетных
// ключей объекта.


// 6. На входе статичный объект. Необходимо числовые значения удвоить на выходе.


// 7. На вход статичный объект. Необходимо объект проверить на пустоту. Если же
// объект пустой, то выводим false, если же содержит хотя бы одну пару (ключ:
// значение), то true


// 8. На входе статичный объект. Необходимо посчитать количество пар (ключ:
// значение)


// 9. На входе статичный объект. Необходимо посчитать количество пар (ключ:
// значение) где значение число и вывести количество


// 10. На входе статичный объект, включающий такие ключи как name, age, birthday,
// значения ключей – пустые строки. Считать данные с клавиатуры и заполнить
// объект соответствующими данными. Добавить проверки на ввод


// 11. На входе пустой объект. С клавиатуры вводятся 2 числа. Необходимо добавить в
// объект ключ “avg” со значением среднего арифметического введенных с чисел
// 12. На входе пустой объект, массив, n – количество элементов массива. Далее
// производится заполнение массива с клавиатуры. Добавить в объект ключ “sum”,
// значение – сумма элементов массива(reduce). Добавить проверки на ввод чисел
// 13. На входе пустой объект; n – количество элементов рандомно сгенерированного
// массива. Необходимо заполнить пустой объект, где ключи – циклично
// сгенерированная последовательность от 0 до n, значения – элемент рандомно
// сгенерированного массива. Math.random()
// 4 -> [34, 11, 43, 1] // 4 – n; элементы массива сгенерированы рандомно
// {
// 0 : 34,
// 1 : 11,
// 2 : 43,
// 3 : 1
// }
// 14. На входе статичный объект с повторяющимися значениями. Необходимо
// отфильтровать значения объекта и оставить только уникальные значения
// { {
// 1 : 1, 1 : 1,
// 2 : 2, 2 : 2,
// 3 : 2, 3 : 3,
// 4 : 3, -> 4 : 4,
// 5 : 4, 5 : 5
// 6 : 4 }
// 7 : 5
// }
// 15. На входе массив чисел. На основе этого массива сформировать объект, где ключ –
// число массива, значение – true/false. True – число четное, false – нечетное
// 16. На входе объект из 5 свойств. Значения вводим с клавиатуры. Необходимо
// проитерировать значения объекта и сформировать на основе этих чисел массив
// 17. Найти значение массива, повторяющееся в нем наибольшее количество раз